Revit 2027 API
MultiReferenceAnnotationType.IsAllowedTagCategory Method
 Returns true if tag types belonging to this category can be used with multi-reference annotation types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAllowedTagCategory(
	ElementId tagCategoryId
)
Public Shared Function IsAllowedTagCategory (
	tagCategoryId As ElementId
) As Boolean
public:
static bool IsAllowedTagCategory(
	ElementId^ tagCategoryId
)
static member IsAllowedTagCategory :
        tagCategoryId : ElementId -> bool
Parameters
tagCategoryId ElementId
 The tag category to test.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only Structural Rebar Tags are allowed.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace